000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧековККМ</name>
  <enumValues>
    <name>Отложенный</name>
  </enumValues>
  <enumValues>
    <name>Аннулированный</name>
  </enumValues>
  <enumValues>
    <name>Пробитый</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыБонусов/ТипыБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБонусов</name>
  <enumValues>
    <name>Органический</name>
  </enumValues>
  <enumValues>
    <name>Акционный</name>
  </enumValues>
  <enumValues>
    <name>Привлечение</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Константы</name>
    </items>
    <items>
      <name>Задачи</name>
    </items>
    <items>
      <name>БизнесПроцессы</name>
    </items>
    <items>
      <name>РегистрыРасчета</name>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
    </items>
    <items>
      <name>ПланыВидовРасчета</name>
    </items>
    <items>
      <name>ПланыСчетов</name>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
    </items>
    <items>
      <name>Обработки</name>
    </items>
    <items>
      <name>Отчеты</name>
    </items>
    <items>
      <name>Справочники</name>
    </items>
    <items>
      <name>Роли</name>
    </items>
    <items>
      <name>РегистрыСведений</name>
    </items>
    <items>
      <name>РегистрыНакопления</name>
    </items>
    <items>
      <name>Подсистемы</name>
    </items>
    <items>
      <name>ПланыОбмена</name>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
    </items>
    <items>
      <name>Документы</name>
    </items>
  </predefined>
  <attributes>
    <name>БезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПустойСсылки</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъектаМетаданных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСсылка</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйСиноним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьАкционныеБонусныеБаллы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/БонусныеБаллыПовтИсп/Module.bsl
#Область ПолучениеНекоторыхНастроекПодсистемы

//	LNK 16.02.2021 09:38:41
Функция ИспользоватьБонуснуюСистему(Период = '00010101')	Экспорт

	УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику(?(Период = '00010101', ТекущаяДата(), Период));

	Возврат УчетнаяПолитика.ИспользоватьБонуснуюСистему;

КонецФункции

Функция НеНачислятьБаллыПриОплатеБонусами()	Экспорт

	Возврат ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику().НеНачислятьБаллыПриОплатеБонусами;

КонецФункции

//	LNK 11.06.2021 07:45:40
Функция СписыватьАкционныеБонусныеБаллы(ПолноеИмяМетаданных)	Экспорт

	Возврат Справочники.ИдентификаторыОбъектовМетаданных.СписыватьАкционныеБонусныеБаллы(ПолноеИмяМетаданных);

КонецФункции

Функция ЕстьТабличнаяЧастьОплатаБонуснымиБаллами(ПолноеИмяМетаданных)	Экспорт

	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);

	Возврат НЕ МетаданныеОбъекта.ТабличныеЧасти.Найти("ОплатаБонуснымиБаллами") = Неопределено;

КонецФункции

Функция ДвиженияЧековВыполняются(СтатусЧекаККМ, Период = '00010101')	Экспорт	//	LNK 20.10.2021 11:44:31

	ЕстьДвижения = ОбменДаннымиПовтИсп.ЭтоГлавныйУзел();	//	в ЦБ движения есть всегда!

	Если НЕ ЕстьДвижения Тогда	//	только на периферии

		УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику(?(Период = '00010101', ТекущаяДата(), Период));

	//	LNK 21.10.2021 04:49:39 "УчетнаяПолитика.ИспользоватьБонуснуюСистему" не учитываем, так как если есть состав ТЧ, то и движения нужно делать.
		Если УчетнаяПолитика.ИспользоватьЧекиКакРегистраторыНачисленияБонусныхБаллов Тогда

				ЕстьДвижения = Истина;

		Иначе	ЕстьДвижения = (СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Пробитый);

		КонецЕсли;

	КонецЕсли;

	Возврат ЕстьДвижения;

КонецФункции

#КонецОбласти

#Область МетодыОпределенияНазначенияТипаБонусов

Функция ПриоритетТипаБонусов(ТипБонусов)	Экспорт

	СоставТипов = Новый Соответствие;
	СоставТипов.Вставить(Перечисления.ТипыБонусов.Органический, 1);
	СоставТипов.Вставить(Перечисления.ТипыБонусов.Привлечение , 2);
	СоставТипов.Вставить(Перечисления.ТипыБонусов.Акционный	  , 3);

	ПриоритетТипа = СоставТипов.Получить(ТипБонусов);
	ПриоритетТипа = ?(ПриоритетТипа = Неопределено, 0, ПриоритетТипа);

	Возврат ПриоритетТипа;

КонецФункции

Функция АвтоматическиеТипыБонусов()	Экспорт

	ТипыБонусов = Новый Массив;

	ТипыБонусов.Добавить(Перечисления.ТипыБонусов.Акционный);

	Возврат ТипыБонусов;

КонецФункции

Функция УправляемыеТипыБонусов()	Экспорт

	ТипыБонусов = Новый Массив;
	АвтоматическиеТипы = АвтоматическиеТипыБонусов();
	#Если _ Тогда
	АвтоматическиеТипы = Новый Массив;
	#КонецЕсли

	Для каждого ТипБонусов Из Перечисления.ТипыБонусов Цикл

		Если АвтоматическиеТипы.Найти(ТипБонусов) = Неопределено Тогда

			ТипыБонусов.Добавить(ТипБонусов);

		КонецЕсли;

	КонецЦикла;

	Возврат ТипыБонусов;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
